# Выполнил Курбанмухаммедов Стив
# Группа П1-18
'''
УП.01 Учебная практика по модулю ПМ.01
Консультация 7. Техника работы со строками
7-1.
Составитель: Гусятинер Л.Б., 26.11.2020, МГОТУ ККМТ, П1-18, П2-18

Задание 1. https://stepik.org/lesson/201702/step/5?unit=175778
С клавиатуры вводятся строки, последовательность заканчивается точкой.
Выведите буквы введенных слов в верхнем регистре, разделяя их пробелами.
'''
words = input()
f = list(words.upper())
print(f)


