# Выполнили:Гусев Никита Сергеевич и Цыпков Илья Владимирович
# Группа: П1-18

# Задание. Разработать программы по темам
# - input
# - print

name = str(input())

print("Hello,", name)
