/**7. Упражнение 3.8. Напишите программу, способную читать строки со стандартного устройства ввода и соединять их в одну большую строку.
Отобразите полученную строку. Измените программу так, чтобы отделить соседние введенные строки пробелами. */

#include <iostream>
#include <string>
using namespace std;

int main() {
    string str1, str2, str;
    cin >> str1 >> str2;
    str = str1 + str2;
    cout << "" << str << endl;
return 0;
}
