/**4. Упражнение 3.5. Напишите программу, читающую со стандартного устройства ввода целые строки.
Измените программу так, чтобы она читала отдельные слова.*/
// Выполнил: Попов Антон, П1-18

#include <iostream>
# include < строка>
использование  пространства  имен std;

int main(){
/ * * строка s
 в то время как (getline(cin, s))
 cout << s <;
 возврат 0; */
 строка s;
	while (cin > > > s)
 cout << s <;
   возврат  0;
}