'''
Задача №1.
Задача «Количество различных чисел»
Условие. Дан список чисел. Определите, сколько в нем встречается различных чисел.
'''
print(len(set(input().split())))
