#include <stdio.h>

/**
Написать программу, которая выводит строку “Hello world!” на консоль.
Митюшин Пётр
*/

int main(){
    printf("Hello world!");
    return 0;
}
