def getDay(n):
    days = ["", "Первое", "Второе", "Третье", "Четвертое", "Пятое", "Шестое", "Седьмое", "Восьмое", "Девятое", "Десятое", "Одиннадцатое", 
    "Двенадцатое", "Тринадцатое", "Четырнадцатое", "Пятнадцатое", "Шестнадцатое", "Семнадцатое", "Восемнадцатое", "Девятнадцатое", "Двадцатое",
    "Двадцать первое", "Двадцать второе", "Двадцать третье", "Двадцать четвертое", "Двадцать пятое"
    , "Двадцать шестое", "Двадцать седьмое", "Двадцать восьмое", "Двадцать девятое", "Тридцатое", "Тридцать первое"]
    
    return days[n]
    
def getMonth(n):
    months = ["", "Января", "Февраля", "Марта", "Апреля", "Мая", "Июня", "Июля", "Августа", "Сентября", "Октября", "Ноября", 
    "Декабря"]
    
    return months[n]

def getYear(n): 
    result = ""
    
    # get thousands (n <= 10000)    
    thousandNumbers = ["", "одна тысяча", "две тысячи", "три тысячи", "четыре тысячи", "пять тысяч", "шесть тысяч", "семь тысяч", "восемь тысяч", 
    "девять тысяч", "десять тысяч"]
    lastThousands = ["", "одно тысячного", "двух тысячного", "трех тысячного", "четырех тысячного", "пяти тысячного",
        "шести тысячного", "семи тысячного", "восьми тысячного", "девяти тысячного", "десяти тысячного"]
    
    thousands = n // 1000
    print(thousands)
    #result += thousandNumbers[thousands]
    
    # get hundreds
    hundredsNumbers = ["", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятсот"]
    lastHundreds = ["", "сотого", "двухсотого", "трехсотого", "четырехсотого", "пятисотого", "шестисотого", "семисотого", "восьмисотого", "девятсотого"]
    hundreds = n % 1000 // 100
    print(hundreds)
    #result += hundredsNumbers[hundreds]
    
    # get dozens and last number
    dozensNumbers = ["", "", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
    lastDozens = ["" ,"десятого", "двадцатого", "тридцатого", "сорокового", "пятидесятого", "шестидесятого", "семидесятого", "восьмидесятого", "девяностого"]
    dozens = n % 100 // 10
    print(dozens)
    oneDozenNumbers = ["", "одиннадцатого", "двенадцатого", "тринадцатого", "четырнадцатого", "пятнадцатого", "шестнадцатого", "семнадцатого", 
        "восемнадцатого", "девятнадцатого"]
    lastNumber = n % 10
    print(lastNumber)
    lastNumbers = ["", "первого", "второго", "третьго", "четвертого", "пятого", "шестого", "седьмого", "восьмого", "девятого"]
    
    result += "года"
    
    if lastNumber == 1:
        result = oneDozenNumbers[lastNumber] + " " + result
    elif lastNumber == 0:
        result = lastDozens[dozens] + " " + result
    else:
        result = lastNumbers[lastNumber] + " " + result
    
    if dozens == 0:
        result = lastHundreds[hundreds] + " " + result
    else:
        result = dozensNumbers[dozens] + " " + result
     
    if hundreds == 0:
        result = lastThousands[thousands] + " " + result
    else:
        result = hundredsNumbers[hundreds] + " " + result
        
    result = thousandNumbers[thousands] + " " + result 
        
        
    return result
    
print(getYear(1952))
