# Выполнил Курбанмухаммедов Стив
# Группа П1-18
'''
УП.01 Учебная практика по модулю ПМ.01
Консультация 4. Техника работы с линейными и разветвляющимися программами
4-1.
Составитель: Гусятинер Л.Б., 25.11.2020, МГОТУ ККМТ, П1-18, П2-18
Задание. Разработать программы по темам
- input
Функция input() в Python, ввод данных с клавиатура.
https://docs-python.ru/tutorial/vstroennye-funktsii-interpretatora-python/funktsija-input/

- print
Функция print() в Python, печатает объект.
https://docs-python.ru/tutorial/vstroennye-funktsii-interpretatora-python/funktsija-print/

- stdin, stdout, stderr модуля sys
Объекты stdin, stdout, stderr модуля sys в Python.
https://docs-python.ru/standart-library/modul-sys-python/obekty-stdin-stdout-stderr-modulja-sys/

- форматная строка и метод формат
'''

def name():
    print('Hello! {}.'.format(namee))

namee = input()
name()



