  '''
Множества
Дан список чисел. Определите, сколько в нем встречается различных чисел.
Брусник Вадим П1-18
'''
print(len(set(input().split())))
